app/Models/egresadosModel.php

SELECT *
FROM `gra_per_gnr_cat`
SELECT *
FROM `srm_esp_cat`
WHERE `esp_sta_cve` = '1'
---
    public function obtenerCombos($control){
try{
        $db = \Config\Database::connect();

        if($control == "2"){
            $builder = $db->table('srm_mta_ctg_cat');
            $builder->select("*");
        }

        if($control == "3"){
            $builder = $db->table('gra_edo_cat a');
            $builder->select("del_cve,a.edo_nom,b.del_nom");
            $builder->join('ims_del_cat b', 'a.edo_cve=b.edo_cve');
        }

        if($control == "4"){
            $builder = $db->table('srm_esp_cat');
            $builder->select("*");
            $builder->where('esp_sta_cve', "1");
        }

        if($control == "5"){
            $builder = $db->table('gra_per_gnr_cat');
            $builder->select("*");
        }

        $query = $builder->get();