app/Models/insertaLogsModel.php

INSERT INTO `logs_api` (`fecha_consulta`, `campos`) VALUES ('2025-09-10 00:55:03', '{\"categoria\":\"CIFRHS - ENARM\",\"tipo_especialidad\":\"DIRECTA\",\"tipo\":\"NACIONAL\",\"curp\":\"LOOA941204HOCPJB07\"}')
---
    public function guardaLog($categoria, $tipo_especialidad, $tipo, $curp = null)
    {
        $campos=[
            "categoria" => $categoria,
            "tipo_especialidad" => $tipo_especialidad,
            "tipo" => $tipo,
            "curp" => $curp
        ];

        $data = [
            "fecha_consulta" => date("Y-m-d H:i:s"),
            "campos" => json_encode($campos)
        ];

        $db = \Config\Database::connect();
        $builder = $db->table('logs_api');
        $builder->insert($data);